In [2]:
# Pandas is a python library used for working with tabular data, such as data stored in spreadsheets or databases
# Pandas will help you to explore, clean and process your data. 
# In pandas, a data table is called a DataFrame.
# Dataframe is like a 2 dimensional array or a table with rows or columns
#
# In this topic we'll use jupyter notebook to better visualize the data using pandas. 
# Using jupyter notebook, you can directly run each cell with code and display the dataframe contents easily.
# To use Jupyter Notebook, first install Jupyter extension on VSCode, then on terminal run 'jupyter notebook' 
# which will direct you to the browser and lets you open an existing jupyter notebook in .ipynb extension 
# or create a new notebook.
# 
# You can also run jupyter notebook directly on vscode. 
# Reference link to the jupyter notebook setup in vscode:
# https://code.visualstudio.com/docs/python/jupyter-support#:~:text=You%20can%20create%20a%20Jupyter,edit%20and%20run%20code%20cells. 
#
# References: 
# https://pandas.pydata.org/docs/
# https://realpython.com/pandas-dataframe 


import pandas as pd

# Using dictionary to create a dataframe
data = {
    'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
    'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai',
             'Manchester', 'Cairo', 'Osaka'],
    'age': [41, 28, 33, 34, 38, 31, 37],
    'py-score': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]
}

row_labels = [101, 102, 103, 104, 105, 106, 107]

In [3]:
# Creating a Dataframe
df = pd.DataFrame(data=data, index=row_labels)
df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [4]:
# Creating a Pandas DataFrame From Files
# You can save and load the data and labels from a Pandas DataFrame to and from a number of file types, 
# including CSV, Excel, SQL, JSON, and more. This is a very powerful feature
# Saving the created dataframe as CSV file
df.to_csv('data.csv')

In [5]:
#  In this case, index_col=0 specifies that the row labels are located in the first column of the CSV file.
df = pd.read_csv('data.csv', index_col=0)

In [6]:
# Getting the dataframe dimension
df.shape
count_row = df.shape[0]  # Gives number of rows
count_col = df.shape[1]  # Gives number of columns

In [7]:
# Getting the size of dataframe
df.size

28

In [8]:
# Getting first 3 rows
df.head(n=3)

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0

In [9]:
df.tail(n=2)

     name   city  age  py-score
106  Amal  Cairo   31      61.0
107  Nori  Osaka   37      84.0

In [10]:
# Accessing a column in pandas dataframe
cities = df['city']
print(cities)

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [11]:
df.name

101    Xavier
102       Ann
103      Jana
104        Yi
105     Robin
106      Amal
107      Nori
Name: name, dtype: object

In [12]:
# getting a particular cell value
# row and column
df.loc[103, 'name'] 
df.iloc[3, 1]

'Shanghai'

In [13]:
# get full rows
df.loc[106]
df.iloc[5]

name         Amal
city        Cairo
age            31
py-score       61
Name: 106, dtype: object

In [14]:
# Iterate on columns
for i in df['py-score']:
    print(i)
# Iterate by rows
for i in df.loc[106]:
    print(i)

88.0
79.0
81.0
80.0
68.0
61.0
84.0
Amal
Cairo
31
61.0

In [15]:
# return a dataframe, using [[]] and list of row labels 
df.loc[[101, 106]]

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
106    Amal        Cairo   31      61.0

In [16]:
# Setting Data With Accessors
df.loc[101, 'age'] = 45
df

       name         city  age  py-score
101  Xavier  Mexico City   45      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [17]:
# Adding a new row
df.loc['106'] = ['Batman', 'Manila', '30', 100]

In [18]:
# Adding a new column 
df['js-score'] = [90, 91, 92, 93, 94, 95, 96, 99]
df

       name         city age  py-score  js-score
101  Xavier  Mexico City  45      88.0        90
102     Ann      Toronto  28      79.0        91
103    Jana       Prague  33      81.0        92
104      Yi     Shanghai  34      80.0        93
105   Robin   Manchester  38      68.0        94
106    Amal        Cairo  31      61.0        95
107    Nori        Osaka  37      84.0        96
106  Batman       Manila  30     100.0        99

In [19]:
#Applying Arithmetic Operations
df['Average test scrores'] = (df['py-score'] + df['js-score']) / 2

In [23]:
# Sorting columns
df.sort_values(by='Average test scrores', ascending=True, inplace=True)
df

       name         city age  py-score  js-score  Average test scrores
106    Amal        Cairo  31      61.0        95                  78.0
105   Robin   Manchester  38      68.0        94                  81.0
102     Ann      Toronto  28      79.0        91                  85.0
103    Jana       Prague  33      81.0        92                  86.5
104      Yi     Shanghai  34      80.0        93                  86.5
101  Xavier  Mexico City  45      88.0        90                  89.0
107    Nori        Osaka  37      84.0        96                  90.0
106  Batman       Manila  30     100.0        99                  99.5

In [24]:
# Creating a Filter for scores greater or equal to 90.
high_score = df['py-score'] >= 90

In [25]:
# Access the dataframe with the high_score filter
df.loc[high_score]

       name    city age  py-score  js-score  Average test scrores
106  Batman  Manila  30     100.0        99                  99.5